{
  "backend/main.mo": "Empty Motoko actor serving as a placeholder backend entry point with no implemented functionality.",
  "feature_evidence.json": "Feature evidence report mapping each product feature (navbar, hero, about, water solution, etc.) to the source files and components that implement them, along with confidence levels and test IDs.",
  "frontend-file-summaries.txt": "JSON dictionary providing one-sentence descriptions of each frontend source file, serving as a quick reference for the purpose and notable details of every component, hook, and config file.",
  "frontend/index.css": "Global Tailwind CSS entry point that defines OKLCH-based CSS custom properties for light and dark theme tokens (colors, borders, chart colors, sidebar) used throughout the app.",
  "frontend/index.html": "Minimal HTML shell for the ImpactFlow React SPA, mounting the app into a root div and loading the TypeScript entry point as an ES module.",
  "frontend/src/App.tsx": "Root React component that composes all page sections — Navbar, Hero, About, WaterSolution, Industries, HowItWorks, SocialImpact, WhyChooseUs, Contact, and Footer — into a single-page layout.",
  "frontend/src/components/AboutSection.tsx": "About Us section displaying a headline, body copy, a four-point bullet list with check icons, a closing quote, and a 2×2 grid of stat cards with scroll-triggered fade-in animation.",
  "frontend/src/components/ContactSection.tsx": "Contact form section with five fields (name, organization, phone, email, objective) that submits to a Formspree endpoint, handles loading/success/error states, and shows contact info alongside the form.",
  "frontend/src/components/Footer.tsx": "Deep-navy site footer with the ImpactFlow logo, tagline, smooth-scroll nav links, social media icon buttons, contact details, copyright line, and a caffeine.ai attribution link.",
  "frontend/src/components/HeroSection.tsx": "Full-screen hero section with animated bottle silhouettes, gradient background, headline copy, and two CTA buttons that smooth-scroll to contact and about sections.",
  "frontend/src/components/HowItWorksSection.tsx": "Displays a 5-step campaign process (Planning → Branding → Production → Distribution → Report) in a responsive grid with icons, numbered badges, and a scroll-triggered fade-in animation.",
  "frontend/src/components/IndustriesSection.tsx": "Renders a grid of five industry cards (schools, colleges, hospitals, events, local businesses) plus a CTA card, with scroll-triggered animation and hover effects.",
  "frontend/src/components/Navbar.tsx": "Fixed navigation bar with scroll-aware background, smooth-scroll anchor links, and a collapsible mobile menu toggled by a hamburger button.",
  "frontend/src/components/SocialImpactSection.tsx": "Two-column section pairing a community-event image with descriptive copy and three impact pillars (Hydration, Awareness, Community Care), animated on scroll.",
  "frontend/src/components/WaterSolutionSection.tsx": "Renders the 'Our Flagship Solution' marketing section featuring an SVG water bottle mockup with a custom label and a list of campaign inclusions (labels, distribution, engagement, documentation).",
  "frontend/src/components/WhyChooseUsSection.tsx": "Renders the 'Why Choose Us' section with a scroll-animated grid of five reason cards (transparency, targeting, compliance, community, trust) plus a highlight stat card.",
  "frontend/src/hooks/useActor.ts": "Custom hook that creates and caches an ICP backend actor (authenticated or anonymous) using React Query, and invalidates dependent queries whenever the actor changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides an Internet Identity authentication context and hook, managing AuthClient creation, login/logout flow, and persisting identity across page reloads.",
  "frontend/src/hooks/useScrollAnimation.ts": "Custom hook that uses IntersectionObserver to set an `isVisible` flag when a referenced element scrolls into view, supporting configurable threshold, root margin, and one-time triggering.",
  "frontend/src/index.css": "Global stylesheet that imports fonts, configures Tailwind layers, defines OKLCH-based brand CSS custom properties for light/dark modes, and declares keyframe animations (fadeInUp, float variants).",
  "frontend/src/main.tsx": "Application entry point that mounts the React app wrapped with React Query's QueryClientProvider and the InternetIdentityProvider.",
  "frontend/tailwind.config.js": "Tailwind CSS configuration extending the theme with ImpactFlow brand OKLCH color tokens, custom fonts, border radii, box shadows, and enabling typography, container-queries, and animate plugins.",
  "project_state.json": "Tracks the state of the ImpactFlow business website project, including architecture notes, color palette, existing features, known issues, and image requirements. Serves as the build plan reference for a frontend-only social impact marketing agency site."
}